function [T, Pos] =  FK(q) 

a2 = -0.42500;
a3 = -0.39225; 
d1 = 0.089159;
d4 = 0.10915;
d5 = 0.09465;
d6 = 0.08230;

q1=q(1);q2=q(2);q3=q(3);q4=q(4);q5=q(5);q6=q(6);


c234 = cos(q2+q3+q4); s234 = sin(q2+q3+q4);
s23 = sin(q2 + q3); c23 = cos(q2 + q3);
s1 = sin(q1); s2 = sin(q2); s3 = sin(q3); s4 = sin(q4); s5 = sin(q5); s6 = sin(q6);
c1 = cos(q1); c2 = cos(q2); c3 = cos(q3); c4 = cos(q4); c5 = cos(q5); c6 = cos(q6);

% original equations
T(1,1) = ((c1*c234-s1*s234)*s5)/2.0 - c5*s1 + ((c1*c234+s1*s234)*s5)/2.0;
T(1,2) = (c6*(s1*s5 + ((c1*c234-s1*s234)*c5)/2.0 + ((c1*c234+s1*s234)*c5)/2.0) - ...
      (s6*((s1*c234+c1*s234) - (s1*c234-c1*s234)))/2.0);
T(1,3) = (-(c6*((s1*c234+c1*s234) - (s1*c234-c1*s234)))/2.0 - ...
      s6*(s1*s5 + ((c1*c234-s1*s234)*c5)/2.0 + ((c1*c234+s1*s234)*c5)/2.0));
T(1,4) = ((d5*(s1*c234-c1*s234))/2.0 - (d5*(s1*c234+c1*s234))/2.0 - ...
      d4*s1 + (d6*(c1*c234-s1*s234)*s5)/2.0 + (d6*(c1*c234+s1*s234)*s5)/2.0 - ...
      a2*c1*c2 - d6*c5*s1 - a3*c1*c2*c3 + a3*c1*s2*s3);
T(2,1) = c1*c5 + ((s1*c234+c1*s234)*s5)/2.0 + ((s1*c234-c1*s234)*s5)/2.0;
T(2,2) = (c6*(((s1*c234+c1*s234)*c5)/2.0 - c1*s5 + ((s1*c234-c1*s234)*c5)/2.0) + ...
      s6*((c1*c234-s1*s234)/2.0 - (c1*c234+s1*s234)/2.0));
T(2,3) = (c6*((c1*c234-s1*s234)/2.0 - (c1*c234+s1*s234)/2.0) - ...
      s6*(((s1*c234+c1*s234)*c5)/2.0 - c1*s5 + ((s1*c234-c1*s234)*c5)/2.0));
T(2,4) = ((d5*(c1*c234-s1*s234))/2.0 - (d5*(c1*c234+s1*s234))/2.0 + d4*c1 + ...
      (d6*(s1*c234+c1*s234)*s5)/2.0 + (d6*(s1*c234-c1*s234)*s5)/2.0 + d6*c1*c5 - ...
      a2*c2*s1 - a3*c2*c3*s1 + a3*s1*s2*s3);
T(3,1) = ((c234*c5-s234*s5)/2.0 - (c234*c5+s234*s5)/2.0);
T(3,2) = ((s234*c6-c234*s6)/2.0 - (s234*c6+c234*s6)/2.0 - s234*c5*c6);
T(3,3) = (s234*c5*s6 - (c234*c6+s234*s6)/2.0 - (c234*c6-s234*s6)/2.0);
T(3,4) = (d1 + (d6*(c234*c5-s234*s5))/2.0 + a3*(s2*c3+c2*s3) + a2*s2 - ...
     (d6*(c234*c5+s234*s5))/2.0 - d5*c234);
T(4,1) = 0;
T(4,2) = 0;
T(4,3) = 0;
T(4,4) = 1;


% %     %已知关节角求变换矩阵
% %     a=[0,-425/5,-392/5,0,0,0];
% %     d=[90/5,0,0,110/5,95/5,82/5];
% %     alpha=[pi/2, 0, 0, pi/2, -pi/2, 0];
% 
%     %已知关节角求变换矩阵
%     a=[0,0.42500,0.39225,0,0,0];
%     d=[0.089159,0,0,0.10915,0.09465,0.08230];
%     alpha=[pi/2,0,0,pi/2,-pi/2,0];
%   
%     T1=T_para(q(1),d(1),a(1),alpha(1));
%     T2=T1*T_para(q(2),d(2),a(2),alpha(2));
%     T3=T2*T_para(q(3),d(3),a(3),alpha(3));
%     T4=T3*T_para(q(4),d(4),a(4),alpha(4));
%     T5=T4*T_para(q(5),d(5),a(5),alpha(5));
%     T=T5* T_para(q(6),d(6),a(6),alpha(6));
%     
    phi_x = atan2(T(3,1),T(3,2));
    phi_z = atan2(T(1,3),-T(2,3));
    phi_y = atan2(sqrt(T(1,3)^2+T(2,3)^2),T(3,3));
    
    Pos = [T(1:3,4);phi_x;phi_y;phi_z];
    
end
%  
% function T = T_para(theta,d,a,alpha)
%     T=[ccc(theta),-sss(theta)*ccc(alpha),sss(theta)*sss(alpha),a*ccc(theta);
%         sss(theta),ccc(theta)*ccc(alpha),-ccc(theta)*sss(alpha),a*sss(theta);
%         0,sss(alpha),ccc(alpha),d;
%         0,0,0,1];
% end
%  
% function sss=sss(a)
% %     sss=sin(a/180*pi);
%     sss=sin(a);
% end
%  
% function ccc=ccc(a)
% %     ccc=cos(a/180*pi);
%      ccc=cos(a);
% 
% end
